nxp-mcuxpresso/mcuxsdk-examples/_boards/mcxn5xxevk/driver_examples/sai/edma_ping_pong_buffer_half_interrupt/pin_mux.c
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v6.0
processor: K32L4A5
package_id: K32L4A50VLL1AT
mcu_data: ksdk2_0
processor_version: 0.0.0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '3', peripheral: LPUART1, signal: TX, pin_signal: ADC0_B10/TSI0_CH6/PTB2/LPSPI1_SCK/LPUART1_TX/LPI2C1_SCLS/TPM1_CH2/SAI0_TXD0/FLEXIO0_D10/PWM0_A1}
  - {pin_num: '4', peripheral: LPUART1, signal: RX, pin_signal: ADC0_B11/TSI0_CH7/PTB3/LPSPI1_SOUT/LPUART1_RX/LPI2C1_SDAS/TPM1_CH3/SAI0_RXD0/FLEXIO0_D11/PWM0_B1}
  - {pin_num: '6', peripheral: LPUART1, signal: RTS, pin_signal: PTB5/LPSPI1_PCS2/LPUART1_RTS_b/LPI2C1_SCL/I3C0_SCL/SAI0_RX_FS/FLEXIO0_D13/PWM0_B2}
  - {pin_num: '5', peripheral: LPUART1, signal: CTS, pin_signal: PTB4/LPSPI1_PCS3/LPUART1_CTS_b/LPI2C1_SDA/I3C0_SDA/SAI0_RX_BCLK/FLEXIO0_D12/PWM0_A2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    CLOCK_EnableClock(kCLOCK_PortA);
    CLOCK_EnableClock(kCLOCK_PortC);

    /* PORTB2 (pin 3) is configured as LPUART1_TX */
    PORT_SetPinMux(PORTB, 2U, kPORT_MuxAlt3);

    /* PORTB3 (pin 4) is configured as LPUART1_RX */
    PORT_SetPinMux(PORTB, 3U, kPORT_MuxAlt3);

    PORT_SetPinMux(PORTB, 4U, kPORT_MuxAlt4);
    PORT_SetPinMux(PORTB, 5U, kPORT_MuxAlt4);

    /* TX BCLK */
    PORT_SetPinMux(PORTB, 9U, kPORT_MuxAlt6);
    /* TX FS */
    PORT_SetPinMux(PORTB, 10U, kPORT_MuxAlt6);
    /* TX MCLK */
    PORT_SetPinMux(PORTB, 6U, kPORT_MuxAlt6);
    /* TX TXD0 */
    PORT_SetPinMux(PORTB, 8U, kPORT_MuxAlt6);
    /* RX RXD1 */
    PORT_SetPinMux(PORTB, 7U, kPORT_MuxAlt6);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
